{
  "endReached":"Вы добрались до конца раздела!",
  "continueToNext":"Давайте изучать следующий раздел!",
  "rememberToCheckPoints":"Вы можете проверить свои текущие оценки в синей области в правом нижнем углу страницы.",
  "footer-src":"Исходный код материала",
  "footer-edit-page": "Редактировать страницу",
  "footer-report-issue":"Report issue",
  "makers":"Этот курс создан группой Agile Education Research",
  "rage":"Университета Хельсинки",
  "credits": "О материале и его создателях",
  "twitter-aria":"Mooc.fi профиль Twitter",
  "facebook-aria":"Mooc.fi профиль Facebook",
  "yourube-aria":"Mooc.fi канал YouTube",
  "logout":"Выйти",
  "newAccount":"Создать новый аккаунт",
  "login":"Войти",
  "mailingListTitle":"Напомните мне, когда начнется курс",
  "subscribe":"подписаться",
  "tableOfContents":"Содержание",
  "sampleOutput":"Пример консоли вывода",
  "sampleData":"Пример данных",
  "loginToSeeExercise":"Войти, чтобы посмотреть упражнение",
  "loginToAttemptExercise":"Войдите, чтобы выполнить упражнение.",
  "pleaseLogin":"Вы не вошли в систему. Некоторые части материала предназначены только для зарегистрированных пользователей. Вы можете зарегистрироваться здесь:",
  "inThisSection":"В этом разделе:" ,
  "programmingExercise":"Упражнение по программированию:",
  "moodleExercise": "Упражнения MOODLE:",
  "sqlTrainerExercise": "Тренировочные упражнения SQL:",
  "points":"Оценки",
  "submitNB":"Заметка: Некоторые упражнения имеют несколько частей, и вы можете получать очки для разных частей отдельно. Можно также отправить частично завершенное упражнение, выбрав «Отправить решение» из меню рядом с кнопкой для выполнения тестов",
  "installationGuideLink":"Ссылка на инструкцию по установке",
  "submitHowTo":"Предложить вариант инструкции",
  "loginForExercise":"Войти, чтобы посмотреть упражнение",
  "loginToSeeExercisePoints": "Войдите, чтобы увидеть оценки за упражнения.",
  "submitNetBeans":"Загрузите свое решение для проверки на сервере в среде программирования NetBeans:",
  "seeSubmissions":"Вы можете увидеть свои материалы в среде 'Тесты моего кода'.",
  "here":"здесь",
  "solutionHowTo":"Как посмотреть решение",
  "coinSolutionHowTo":"Как посмотреть решение перед выполнением упражнения",
  "noCoin":"В этом упражнении вы не можете использовать монету для просмотра решения перед отправкой упражнения.",
  "noCoinsOnCourse": "Вы не можете просмотреть решение до завершения упражнения этого курса.",
  "modelSolutionUnavailableBecauseEmailNotVerified": "Пожалуйста, проверьте свой адрес электронной почты, чтобы включить режим отправки решений задач.",
  "whyCoin":"Вы можете посмотреть решение до или после подачи упражнения. Если вы хотите увидеть решение перед отправкой упражнения, вы должны использовать монеты.",
  "coinCost": "Модельное решение стоит столько же монет, сколько стоит упражнение.",
  "usesCoinMultiplePoints": "цена:",
  "usesCoinMultiplePoints2": "монет",
  "getNewCoin":"Вы получите новую монету, когда загрузите свое решение",
  "getNewCoin2":"упражнения. Вы можете использовать монеты, чтобы увидеть решения для упражнений и выбраться из тупика.",
  "oneCoin":"У вас есть 1 монета",
  "howManyCoins":"Увас есть <1>{{count}}</1> монет.",
  "nocoins":"У вас еще нет монет.",
  "howCoins":"Монеты используются только при помощи нажатия кнопки «Использовать монеты» под этим текстом. Решение можно увидеть без использования монет в сервисе Test My Code либо в Netbeans, либо на сайте TMC после завершения и отправки соответствующего упражнения.",
  "howSeeSolution":"Решение можно увидеть в сервисе Test My Code либо в TMCBeans, либо на сайте TMC после выполнения соответствующего упражнения.",
  "seeSolution":"Посмотреть решение",
  "usesCoin":"Использует монету",
  "coinUsed":"Вы уже использовали монету для этого решения",
  "update":"Обновить",
  "solution":"Решение",
  "exerciseList":"Список упражнений этого раздела",
  "unknownType":"Неизвестный тип упражнения",
  "quiz":"Викторина",
  "loading":"Загрузка данного раздела курса...",
  "loginToSee":"Здесь есть материал, который доступен только для зарегистрированных пользователей. Войдите, чтобы его увидеть.",
  "errorInMaterial":"Невозможно загрузить материалы этого раздела из-за ошибки: ",
  "incorrectMaterial":"Невозможно загрузить материал. Причина: отсутствует идентификатор.",
  "loggedInWith":"Ваша учетная запись: ",
  "studentInfo":"Информация для студентов",
  "aboutYourself":"Расскажите нам немного о себе. На основе этой информации регистрируются оценки и организуется изучение курса. Отредактировать свою информацию можно позже в настройках курса. После заполнения этих данных нажмите «Сохранить» в нижней части страницы.",
  "firstName":"Имя",
  "lastName":"Фамилия",
  "sid":"Номер зачетной книжки университета",
  "nosid":"Оставьте поле пустым, если вы не являетесь студентом университета.",
  "marketing":"Можно отправлять мне информацию о новых курсах",
  "courseInfo": "Информация о курсе",
  "useCourseVariantLabel": "Я также изучаю другие курсы, кроме этого он-лай курса. Открытый курс или курс университета.",
  "courseVariant": "Поставщик курсов",
  "chooseCourse": "Выберите курс",
  "researchTitle":"Темы исследований на этом курсе",
  "research1":"Данные этого курса используются для оценки процесса обучения. Исследование имеет несколько целей: ",
  "research2":"Создание адаптируемых учебных материалов, которые учитывают различия между учащимися и при необходимости предоставляют более индивидуальные учебные материалы.",
  "research3":"Улучшение наших навыков обучения в цифровой среде.",
  "research4":"Поддержка заинтересованных сторон, работающих с учебными материалами и оценивания процесса обучения (психолого-педогагических процессов). Что естественным образом должно привести к лучшим результатам обучения студентов.",
  "research5":"Если вам интересно проводить аналитику процессов, можете почитать статьи",
  "research6":"Данные исследования курса обрабатываюся под руководством Матти Лууккайненом из группы Agile Education Research на кафедре компьютерных наук Университета Хельсинки. Вы можете запросить удаление любых данных, собранных о вас в любое время, отправив электронное письмо по адресу mooc@cs.helsinki.fi",
  "research7":"Данные, собранные на этом курсе, используются в различных исследованиях. Собранные данные содержат информацию об использовании материала, процессе выполнения упражнений и данные, собранные в процессе проведения экзаменов. Данные публикуются в анонимном виде. Отказ от участия в исследовании не влечет никаких негативных последствий для студента курса.",
  "researchAgree":"Участие в исследовании",
  "researchYes":"Я буду участвовать в исследовании. Выбрав этот вариант, вы поможете нынешним и будущим студентам.",
  "researchNo":"Я не буду участвовать в исследовании.",
  "save":"Сохранить",
  "fillRequired":"Пожалуйста, заполните требуемые поля.",
  "reportIssueTitle":"Как уведомить об ошибке или недочете в материалах",
  "reportIssueButtonText":"Создать новое уведомление",
  "reportIssueSecondHeader":"Как составить уведомление",
  "reportIssue1":"Вы можете сообщить об ошибке, которую вы обнаружили на вкладке вопросов проекта Github. Github - это сервис, где проектами, программным обеспечением и исходным кодом можно управлять и делиться с другими.",
  "reportIssue2":"Стобы уведомить о проблеме требуется учетная запись Github. Если у вас еще нет учетной записи, вы можете создать ее",
  "reportIssue3":"здесь",
  "reportIssue4":"Прежде чем вы откроете новый вопрос, пожалуйста, проверьте",
  "reportIssue5":"есть ли уже открытое уведомление об обнаруженной вами ошибке.",
  "reportIssue6":"Мы вам можем задать несколько уточняющих вопросов, если мы не сможем решить проблему без вашей помощи. Github должен отправить уведомление по электронной почте относительно этих вопросов на адрес электронной почты, связанный с вашей учетной записью Github.",
  "reportIssue7":"Спасибо за помощь в улучшении наших материалов!",
  "reportIssueList1":"Нажмите кнопку, находящуюся выше.",
  "reportIssueList2":"Пожалуйста, включите краткое и информативное название в свой отчет о выпуске, например «Опечатка в Раздела 1 в описании упражнения 30».",
  "reportIssueList3":"Напишите более подробное описание проблемы в разделе комментариев, например \"В части 1 упражнения 30 вывод образца содержит опечатку. Предыдущий код включает строку System.out.println(\"Input number\"); но на выходе примера есть текст \"Output number\".",
  "reportIssueList4":"Наконец, нажмите зеленую кнопку «Submit new issue».",
  "editPageTitle":"Как загрузить вашу редакию материала",
  "editPageButtonText":"Редактировать страницу ",
  "editPageSecondHeader":"Как отправить отредактированный вариант",
  "editPage1":"Вы можете отправить ваш варианрт редакции материала в проект курса Github. Github - это сервис, где проектами, программным обеспечением и исходным кодом можно управлять и делиться с другими.",
  "editPage2":"Для отправки варианта редакции требуется учетная запись Github. Если у вас еще нет учетной записи, вы можете создать ее",
  "editPage3":"здесь",
  "editPage4":"Перед отправкой вашего варианта, пожалуйста, проверьте",
  "editPage5":"если кто-то уже предложил такой же вариант исправления материала.",
  "editPage6":"Спасибо за помощь в улучшении наших материалов!",
  "editPageList1":"Нажмите кнопку, расположенгную выше, чтобы отредактировать страницу, где вы только что были.",
  "editPageList2":"Можно переключать стиль отображения длинных строк от «No wrap» -> «Soft wrap» в правом верхнем углу окна редактирования.",
  "editPageList3":"Поиск раздела в материале, который вы хотите отредактировать. Найти нужный раздел, нажав Ctrl+F и написав соответствующий поисковый запрос.",
  "editPageList4":"Прокрутите страницы до низу и напишите короткий и информативный заголовок в поле «Предложить изменение файла», например «Зафиксировать опечатку в Разделе 2».",
  "editPageList5":"нажмите зеленую кнопку «Предложить изменение файла». Это должно перенаправить вас на другую страницу.",
  "editPageList6":"На перенаправленной странице нажмите кнопку \"New Pull Request\".",
  "difficultyHeader": "Сложность: -",
  "difficultyHeader1": "Сложность: Легкая",
  "difficultyHeader2": "Сложность: Не простая",
  "difficultyHeader3": "Сложность: Высокая"
}
